#+TITLE: GVM Performance Measurements
#+AUTHOR:      Foivos S. Zakkak
#+EMAIL:       foivos@zakkak.net
#+STARTUP:     hidestars
#+STARTUP:     showall

* Breakdown

  |---------------------------------------+-------------------|
  | Event                                 |      Clock Cycles |
  |---------------------------------------+-------------------|
  | currentTimeMillis granularity         |            ~20000 |
  |---------------------------------------+-------------------|
  | dir_lookup in sc_get                  |   med:449 avg:499 |
  |                                       |           429-867 |
  |---------------------------------------+-------------------|
  | dir_insert in sc_put                  |   med:497 avg:591 |
  |                                       |          165-1092 |
  |---------------------------------------+-------------------|
  | block_to_oop                          |   med:167 avg:256 |
  |                                       |            94-516 |
  |---------------------------------------+-------------------|
  | sc_put in sc_get                      | med:1505 avg:2007 |
  |                                       |          450-3231 |
  |---------------------------------------+-------------------|
  | sc_translate (w/ sc_get)              |            28-180 |
  |---------------------------------------+-------------------|
  | fetch                                 |   med:472 avg:701 |
  |                                       |          380-2049 |
  |---------------------------------------+-------------------|
  | Bytecode exec in the loop             |    med:96 avg:639 |
  |                                       |        52-1407329 |
  |---------------------------------------+-------------------|
  | get instancesizebytes in block_to_oop |   med:151 avg:211 |
  |                                       |            17-417 |
  |---------------------------------------+-------------------|
  | HW cache flush (no transfer)          |               688 |
  |---------------------------------------+-------------------|
  | SW cache flush w/ HW (no transfer)    |             64823 |
  |---------------------------------------+-------------------|
  | HW cache flush & clear                |              1084 |
  |---------------------------------------+-------------------|
  | SW cache clear w/ HW                  |              5434 |
  |---------------------------------------+-------------------|

* AtomicInteger.compareAndSet with constant failures

  |-------------+----------------+-------------------------|
  |             | Atomic Manager | Readers Writers Locking |
  |-------------+----------------+-------------------------|
  | Single core | 885 ms         | 421 ms                  |
  |-------------+----------------+-------------------------|

* AtomicInteger.getAndIncrement

  |-------------------------------+--------+--------------------------|
  |                               |   Goal | Readers Writers Locking  |
  |-------------------------------+--------+--------------------------|
  | Single MB core                |    100 | 3325 ms (33,250,000 cc)  |
  |-------------------------------+--------+--------------------------|
  | 503 tasks on                  |   5030 | 47612 ms                 |
  | 64 boards                     |        | (476,120,000 cc)         |
  |-------------------------------+--------+--------------------------|
  | 503 tasks on                  |  50300 | 463529 ms (34033ms +1wa) |
  | 64 boards                     |        | (4,635,297,296 cc)       |
  |                               |        |                          |
  |-------------------------------+--------+--------------------------|
  | 503 tasks on                  | 100600 | 931819 ms (72827ms +2wa) |
  | 64 boards                     |        | (9,318,204,592 cc)       |
  |-------------------------------+--------+--------------------------|
  | 503 tasks on                  | 503000 | XXX ms                   |
  | 64 boards                     |        | (XXX,XXX,XXX cc)         |
  |-------------------------------+--------+--------------------------|
  | 503 tasks on 64               |   5030 | 6666 ms                  |
  | hydra cores                   |        | (13,998,600,000 cc)      |
  |-------------------------------+--------+--------------------------|
  |                               |        |                          |
  |                               |        |                          |
  |-------------------------------+--------+--------------------------|
  | 64 tasks on 64                |   6400 | 60728 ms                 |
  | microblaze                    |        | (607,280,000 cc)         |
  |-------------------------------+--------+--------------------------|
  | 64 tasks on 64                |   6400 | 72 ms                    |
  | hydra cores                   |        | (151,200,000 cc)         |
  |-------------------------------+--------+--------------------------|

  A timer wrap-around (wa) is 4294967296 cc = ~429,496ms = ~7.158278827 min

* Jembench

  Jembench reports performance as times/sec that an app can run (higher
  is better).

** Application

   |-----------+--------+--------+-----------+---------------------|
   | Benchmark | Formic |    x86 |   SpeedUp | Normalized on Clock |
   |-----------+--------+--------+-----------+---------------------|
   | Kfl       |  54.04 | 303758 | 5620.9845 |           16.532307 |
   |-----------+--------+--------+-----------+---------------------|
   | Lift      |  49.47 | 482325 | 9749.8484 |           28.676025 |
   |-----------+--------+--------+-----------+---------------------|
   | UdpIp     |   3.91 | 133951 | 34258.568 |           100.76049 |
   |-----------+--------+--------+-----------+---------------------|
   #+TBLFM: $4=$3/$2::$5=$4/(3400/10)

** Micro

   |---------------------+--------+------------+--------------+---------------------|
   | Benchmark           | Formic |        x86 |      SpeedUp | Normalized on Clock |
   |---------------------+--------+------------+--------------+---------------------|
   | iload_3 iadd        |  39960 |  648394000 |    16226.076 |           47.723753 |
   |---------------------+--------+------------+--------------+---------------------|
   | iload_3 imul        |  31751 |  651542000 |    20520.362 |           60.354006 |
   |---------------------+--------+------------+--------------+---------------------|
   | iload_3 idiv        |  11409 |  367719000 |    32230.607 |           94.795903 |
   |---------------------+--------+------------+--------------+---------------------|
   | fload_3 fadd        |  35158 |  484540000 |    13781.785 |           40.534662 |
   |---------------------+--------+------------+--------------+---------------------|
   | ldc iadd            |  39009 |  253240000 |    6491.8352 |           19.093633 |
   |---------------------+--------+------------+--------------+---------------------|
   | iinc                |  94160 | 1147160000 |    12183.093 |           35.832626 |
   |---------------------+--------+------------+--------------+---------------------|
   | aload iaload        |  19458 |  512281000 |    26327.526 |             77.4339 |
   |---------------------+--------+------------+--------------+---------------------|
   | if_icmplt not taken |  24749 |  323416000 |    13067.841 |           38.434826 |
   |---------------------+--------+------------+--------------+---------------------|
   | if_icmplt taken     |  24453 |  297600000 |    12170.286 |           35.794959 |
   |---------------------+--------+------------+--------------+---------------------|
   | checkcast           |  20227 |  277883000 |    13738.221 |           40.406532 |
   |---------------------+--------+------------+--------------+---------------------|
   | getfield            |  55727 | 1303084000 |    23383.351 |           68.774562 |
   |---------------------+--------+------------+--------------+---------------------|
   | getstatic iadd      |   8724 |  253240000 |    29027.969 |           85.376379 |
   |---------------------+--------+------------+--------------+---------------------|
   | invokeinterface     |   2989 |  126859000 |    42441.954 |           124.82928 |
   |---------------------+--------+------------+--------------+---------------------|
   | invokestatic        |   5565 |   20687000 |    3717.3405 |           10.933354 |
   |---------------------+--------+------------+--------------+---------------------|
   | invokevirtual       |   5997 |  144631000 |    24117.225 |           70.933015 |
   |---------------------+--------+------------+--------------+---------------------|
   | synchronized(this)  |  46.35 |   82140000 |    1772168.3 |           5212.2597 |
   |---------------------+--------+------------+--------------+---------------------|
   | synchronized method |  46.50 |        n/a | n / (46.5 a) |      n / (15810. a) |
   |---------------------+--------+------------+--------------+---------------------|
   #+TBLFM: $4=$3/$2::$5=$4/(3400/10)

** Kernel

   |------------+--------+--------+-----------+---------------------|
   | Benchmark  | Formic |    x86 |   SpeedUp | Normalized on Clock |
   |------------+--------+--------+-----------+---------------------|
   | Sieve      |  17.76 | 238096 | 13406.306 |           39.430312 |
   |------------+--------+--------+-----------+---------------------|
   | BubbleSort |   8.13 | 124711 | 15339.606 |           45.116488 |
   |------------+--------+--------+-----------+---------------------|
   #+TBLFM: $4=$3/$2::$5=$4/(3400/10)

** Parallel

*** Single Core

    |-----------------------+--------+-------+-----------+---------------------|
    | Benchmark             | Formic |   x86 |   SpeedUp | Normalized on Clock |
    |-----------------------+--------+-------+-----------+---------------------|
    | Matrix Multiplication |   0.30 |  6895 | 22983.333 |           67.598038 |
    |-----------------------+--------+-------+-----------+---------------------|
    | NQueens               |   0.05 |  1357 |    27140. |           79.823529 |
    |-----------------------+--------+-------+-----------+---------------------|
    | Raytrace              |        | 10233 |   10233/0 |       10233/0 / 340 |
    |-----------------------+--------+-------+-----------+---------------------|
    #+TBLFM: $4=$3/$2::$5=$4/(3400/10)

*** On 7 (8) Core

    |-----------------------+--------+-------+-----------+---------------------|
    | Benchmark             | Formic |   x86 |   SpeedUp | Normalized on Clock |
    |-----------------------+--------+-------+-----------+---------------------|
    | Matrix Multiplication |   0.27 | 20831 | 69436.667 |           204.22549 |
    |-----------------------+--------+-------+-----------+---------------------|
    | NQueens               |   0.06 |  4087 |    81740. |           240.41176 |
    |-----------------------+--------+-------+-----------+---------------------|
    | Raytrace              |        | 23953 |   10233/0 |       10233/0 / 340 |
    |-----------------------+--------+-------+-----------+---------------------|
    #+TBLFM: $4=$3/$2::$5=$4/(3400/10)

* TODO MonitorBench

  Creates N threads where each thread tries to acquire a lock 100
  times and do something (a simple for loop iterating
  /artificial_work/ times).

** Content on same lock

*** From a single core 100*N times
    |--------------+-----------------+----------------|
    | # Iterations | Total time (ms) |                |
    |--------------+-----------------+----------------|
    |              | w/ MMGR_QUEUE   | w/o MMGR_QUEUE |
    |--------------+-----------------+----------------|
    |            1 |                 |                |
    |           15 |                 |                |
    |          255 |                 |                |
    |          503 |                 |                |
    |--------------+-----------------+----------------|

*** artificial_work = 0
    |-----------------+---------------------+---------------------|
    | # Tasks         |     Total time (ms) |                     |
    |-----------------+---------------------+---------------------|
    |                 |       w/ MMGR_QUEUE | w/o MMGR_QUEUE      |
    |-----------------+---------------------+---------------------|
    | 1               |                3496 |                     |
    | 15 (2 boards)   |               21843 | 31631               |
    | 255 (32 boards) |              350462 | (186831+1wa) 616327 |
    | 503             | (261301+1wa) 690797 |                     |
    |-----------------+---------------------+---------------------|

    A timer wrap-around (wa) is 4294967296 cc = ~429,496ms = ~7.158278827 min

*** artificial_work = 100
    |---------------+-----------------+----------------|
    |       # Tasks | Total time (ms) |                |
    |---------------+-----------------+----------------|
    |               | w/ MMGR_QUEUE   | w/o MMGR_QUEUE |
    |---------------+-----------------+----------------|
    |             1 | 4266            |                |
    | 15 (2 boards) |                 |                |
    |           503 |                 |                |
    |---------------+-----------------+----------------|

** Race for different locks

*** artificial_work = 0
    |-----------------+-----------------+----------------|
    | # Tasks         | Total time (ms) |                |
    |-----------------+-----------------+----------------|
    |                 |   w/ MMGR_QUEUE | w/o MMGR_QUEUE |
    |-----------------+-----------------+----------------|
    | 1               |            3425 |                |
    | 15 (2 boards)   |            4197 |                |
    | 255 (32 boards) |           17874 |                |
    | 503             |           34615 |          34729 |
    |-----------------+-----------------+----------------|

*** artificial_work = 100
    |---------------+-----------------+----------------|
    |       # Tasks | Total time (ms) |                |
    |---------------+-----------------+----------------|
    |               | w/ MMGR_QUEUE   | w/o MMGR_QUEUE |
    |---------------+-----------------+----------------|
    |             1 | 4254            |                |
    | 15 (2 boards) |                 |                |
    |           503 |                 |                |
    |---------------+-----------------+----------------|

* TODO ThreadStartJoin
  
  Creates and starts N threads that do nothing (empty run() function)
  then joins on them.

    |---------------+-----------------|
    |       # Tasks | Total time (ms) |
    |---------------+-----------------|
    |             1 |                 |
    | 15 (2 boards) |                 |
    |           503 |                 |
    |---------------+-----------------|

